app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations"
---
  def index
    # get all locations in the table locations
    @locations = Location.all

INSERT INTO "locations" ("description", "latitude", "longitude", "name") VALUES (?, ?, ?, ?)  [["description", ""], ["latitude", 31.87385], ["longitude", -116.62773], ["name", "alfredo_house"]]
---
  def create
    # create a new instance variable called @location that holds a Location object built from the data the user submitted
    @location = Location.new(location_params)

    # if the object saves correctly to the database
    if @location.save

SELECT "locations".* FROM "locations"
---
  def radio
    dtor = Math::PI/180 #conversion a radianes
    r = 6378.14*1000 #ecuacion de radio multiplicado por mil para convertir de km a metros
    contador=0
    @aux1=[]
    @aux2=[]
    @aux3=[]
    @aux4=[]

    if request.post?
      @latitude= params[:latitude];
      @longitude = params[:longitude];
      @radio=params[:radio]

      @locations = Location.all

SELECT "locations".* FROM "locations" WHERE "locations"."name" = 'alfredo_house' LIMIT 1
SELECT "locations".* FROM "locations"
SELECT "locations".* FROM "locations" WHERE "locations"."id" IN (31.817894, -116.596892, 10) LIMIT 1
---
  def convex_hull
    mi_casa = Location.find_by_name('alfredo_house')
    @puntos=Location.all

    points  = Array.new()


    @puntos.each do |punto|
      points << [punto[:latitude], punto[:longitude], punto[:id]]
    end

    points = calculate_convex_hull(points)

    @convex_locations = Array.new()
    points.each do |point|
      @convex_locations << Location.find_by_id(point)

SELECT "locations".* FROM "locations"
---
  def poivisited
    uploaded_file = params[:file]
    @file_content = uploaded_file.read
    @objson = JSON.parse(@file_content)
    ruta = @objson.fetch("route")
    @locations = Location.all